'''Задание 1
Пользователь вводит с клавиатуры номер дня недели
(1-7). Необходимо вывести на экран названия дня неде-
ли. Например, если 1, то на экране надпись понедельник,
2 — вторник и т.д.'''


# day = int(input('Введите цифру от 1 до 7, чтобы вывести день недели: '))
# if day == 1:
#     print('Понедельник!')
# elif day == 2:
#     print('Вторник!')
# elif day == 3:
#     print('Среда!')
# elif day == 4:
#     print('Четверг!')
# elif day == 5:
#     print('Пятница!')
# elif day == 6:
#     print('Суббота!')
# elif day == 7:
#     print('Воскресенье!')
# else:
#     print('Неверное значение, введите цифру от 1 до 7.')


'''Задание 2
Пользователь вводит с клавиатуры номер месяца
(1-12). Необходимо вывести на экран название месяца.
Например, если 1, то на экране надпись январь, 2 — фев-
раль и т.д.'''


# month = int(input('Введите цифру от 1 до 12, чтобы вывести месяц года: '))
# if month == 1:
#     print('Январь!')
# elif month == 2:
#     print('Февраль!')
# elif month == 3:
#     print('Март!')
# elif month == 4:
#     print('Апрель!')
# elif month == 5:
#     print('Май!')
# elif month == 6:
#     print('Июнь!')
# elif month == 7:
#     print('Июль!')
# elif month == 8:
#     print('Август!')
# elif month == 9:
#     print('Сентябрь!')
# elif month == 10:
#     print('Октябрь!')
# elif month == 11:
#     print('Ноябрь!')
# elif month == 12:
#     print('Декабрь!')
# else:
#     print('Неверное значение, введите цифру от 1 до 12.')


'''Задание 3
Пользователь вводит с клавиатуры число. Если число
больше нуля нужно вывести надпись «Number is positive»,
если меньше нуля «Number is negative», если равно нулю
«Number is equal to zero»'''


# a = int(input('Введите число: '))
# if a > 0:
#     print('Number is positive')
# elif a < 0:
#     print('Number is negative')
# elif a == 0:
#     print('Number is equal to zero')
# else:
#     print('Неверное значение, введите число!')


'''Задание 4
Пользователь вводит два числа. Определить, равны
ли эти числа, и, если нет, вывести их на экран в порядке
возрастания.'''


# a = int(input('Введите первое число: '))
# b = int(input('Введите второе число: '))
# if a == b:
#     print('Числа равны.')
# elif a != b:
#     max = a
#     if b > a:
#         print()
#     else:
#         print('Числа по возрастанию :', b, a)
#     min = a
#     if b < a:
#         print()
#     else:
#         print('Числа по возрастанию :', a, b)
# else:
#     print('Неверное значение, введите числа!')

