--create database AcademyDZ5;
--go

use AcademyDZ5;
go

create table [Departments]
(
	[Id] int not null identity(1, 1) primary key,
	[Financing] money not null check ([Financing] >= 0.0) default 0.0,
	[Name] nvarchar(100) not null unique check ([Name] <> N''),
	[FacultyId] int not null
);
go

create table [Faculties]
(
	[Id] int not null identity(1, 1) primary key,
	[Name] nvarchar(100) not null unique check ([Name] <> N'')
);

go

create table [Groups]
(
	[Id] int not null identity(1, 1) primary key,
	[Name] nvarchar(100) not null unique check ([Name] <> N''),
	[Year] int not null check ([Year] between 1 and 5),
	[DepartmentId] int not null
);
go

create table [GroupsLectures]
(
	[Id] int not null identity(1, 1) primary key,
	[DayOfWeek] int not null check ([DayOfWeek] between 1 and 7),
	[GroupId] int not null,
	[LectureId] int not null
);
go

create table [Lectures]
(
	[Id] int not null identity(1, 1) primary key,
	[LectureRoom] nvarchar(max) not null check ([LectureRoom] <> N''),
	[SubjectId] int not null,
	[TeacherId] int not null
);
go

create table [Subjects]
(
	[Id] int not null identity(1, 1) primary key,
	[Name] nvarchar(100) not null unique check ([Name] <> N'')
);
go

create table [Teachers]
(
	[Id] int not null identity(1, 1) primary key,
	[Name] nvarchar(max) not null check ([Name] <> N''),
	[Salary] money not null check ([Salary] > 0.0),
	[Surname] nvarchar(max) not null check ([Surname] <> N'')
);
go

alter table [Departments]
add foreign key ([FacultyId]) references [Faculties]([Id]);
go

alter table [Groups]
add foreign key ([DepartmentId]) references [Departments]([Id]);
go

alter table [GroupsLectures]
add foreign key ([GroupId]) references [Groups]([Id]);
go

alter table [GroupsLectures]
add foreign key ([LectureId]) references [Lectures]([Id]);
go

alter table [Lectures]
add foreign key ([SubjectId]) references [Subjects]([Id]);
go

alter table [Lectures]
add foreign key ([TeacherId]) references [Teachers]([Id]);
go

insert into [Faculties] ([Name]) 
values
('Механико-математический факультет'), 
('Философский факультет'), 
('Факультет компьютерных наук и информационных технологий'), 
('Институт физики'), 
('Колледж радиоэлектроники'),
('Институт истории и международных отношений'), 
('Факультет фундаментальной медицины и медицинских технологий'), 
('Факультет иностранных языков и лингводидактики'), 
('Институт химии'), 
('Биологический факультет');
go

insert into  [Departments] ([Name], [Financing], [FacultyId])
values 
('Кафедра динамических систем на базе СФ ИРЭ РАН', 14000,4),
('Кафедра дискретной математики и информационных технологий', 13000,1),
('Кафедра дифференциальных уравнений и математической экономики', 15000,1),
('Кафедра информатики и программирования', 18000,3),
('Кафедра информационных систем и технологий в обучении', 15000,3),
('Кафедра истории', 11000,6),
('Кафедра компьютерной алгебры и теории чисел', 26000,1),
('Кафедра компьютерных наук', 26100,3),
('Кафедра компьютерной физики и метаматериалов', 30000, 3),
('Кафедра математики, информатики, физики', 10700,1),
('Кафедра математических основ информатики и олимпиадного программирования', 28900,1),
('Кафедра математического анализа', 9456,1),
('Кафедра математического и компьютерного моделирования', 16800,1),
('Кафедра математического обеспечения вычислительных комплексов и информационных систем', 17420,3),
('Кафедра математической кибернетики и компьютерных наук', 25000,3),
('Кафедра математической физики и вычислительной математики', 13000,1),
('Кафедра медицинской кибернетики', 10060,7),
('Кафедра международных отношений и внешней политики России', 11500,8),
('Кафедра менеджмента в образовании', 28000,2),
('Кафедра менеджмента и маркетинга', 20999,6),
('Кафедра основ математики и информатики', 16000,1),
('Кафедра разработки программного обеспечения', 19520,3),
('Кафедра ядерной физики', 24050,4),
('Кафедра русского языка и литературы',16000,2),
('Кафедра таможенного дела', 19500,6),
('Кафедра аналитической химии', 15450,9),
('Кафедра химической экспертизы', 3000,9),
('Кафедра микробиологии', 9000, 10);
go

insert into [Groups]  ([Name], [Year], [DepartmentId]) 
values
('QA-130', 1, 1), ('QA-129', 1,6),('QA-128', 1,11),('QA-127', 1,16),('QA-126', 1,21),('QA-125', 1,26),
('QA-224', 2, 2), ('QA-223', 2,7),('QA-222', 2,12),('QA-221', 2,17),('QA-220', 2,22),('QA-219', 2,27),
('QA-318', 3, 3), ('QA-317', 3,8),('QA-316', 3,13),('QA-315', 3,18),('QA-314', 3,23),('QA-313', 3,28),
('QA-412', 4, 4), ('QA-411', 4,9),('QA-410', 4,14),('QA-409', 4,19),('QA-408', 4,24),('QA-407', 4,5),
('QA-506', 5, 5), ('QA-505', 5,10),('QA-504', 5,15),('QA-503', 5,20),('QA-502', 5,25),('QA-501', 5,16);
go

insert into [Subjects] ([Name]) 
values
('Алгебра'), ('Базы данных'), ('Биология'), ('Геометрия'), ('Дискретная математика'), ('Иностранный язык'), 
('Информатика и программирование'), ('Информатика'), ('Кибернетика'), ('Культура речи'), ('Литература'), 
('Маркетинг'), ('Математическая логика и теория алгоритмов'), ('Математический анализ'), 
('Программирование'), ('Русский язык'), ('Физика'), ('Философия'), ('Химия'), ('Ядерная физика'); 
go

insert into [Teachers] ([Name], [Surname], [Salary]) 
VALUES
('Егор','Комнатный', 1440),('Петр','Имнатов', 500),('Иван','Бобровских', 1000),('Алексей','Штатный', 720),
('Юрий','Внештатный', 1052),('Елена','Кривоногова', 2230),('Кристина','Иванова', 720), ('Эльвира','Квадратова', 1500), 
('Анна','Овалова', 580),('Алла','Овалова', 1300),('Егор','Крылатов', 1440),('Петр','Мохнатов', 500), ('Иван','Иголкин', 1000),
('Алексей','Морковкин', 720),('Юрий','Прямой', 1052),('Елена','Кривошеева', 2230),
('Инга','Кислина', 620),('Эльвира','Казакова', 1440),('Анна','Игошина', 900),('Алла','Пустохвалова', 1302);
go

insert into [Lectures] ([LectureRoom],[SubjectId],[TeacherId]) 
values
('А054', 3 , 1 ), ('В101', 18,2), ('Р106',10,3), ('М224',2,4),  ('С001',19,5), ('К022',1,6),
('А055', 16 , 7), ('В102', 5, 8), ('Р107',20,9), ('М225',13,10),('С002',12,11),('К011',15,12),
('А056', 6 , 13), ('В103', 4,14), ('Р108',17,15),('М226',11,16),('С003',8,17), ('К033',14,18),
('А057', 7 , 19), ('В104', 9,20), ('Р109',10,5), ('М227',2,6),  ('С004',19,8), ('К044',1,16),
('А068', 16, 14), ('В105',18,10), ('D201',10,9), ('М230',2,14), ('С005',19,20),('К077',20,20);
go

insert into [GroupsLectures] ([DayOfWeek],[GroupId],[LectureId]) 
values
(7,1,30),(6,2,29),(5,3,28),(4,4,27),(3,5,26),(2,6,25),(1,7,24),
(7,8,23),(6,9,21),(5,10,20),(4,11,19),(3,12,18),(2,13,17),(1,14,16),
(7,15,15),(6,16,14),(5,17,13),(4,18,12),(3,19,11),(2,20,10),(1,21,9),
(1,22,8),(2,23,7),(3,24,6),(4,25,5),(5,26,4),(6,27,3),(7,28,2),
(1,29,1),(2,30,22),(3,1,16),(4,2,17),(5,3,18),(6,4,19),(7,5,20),
(1,6,21),(2,7,22),(3,8,30),(4,9,29),(5,10,28),(6,11,27),(7,12,26),
(7,13,25),(6,14,24),(5,15,23),(4,16,1),(3,17,2),(2,18,3),(1,19,4),
(1,20,5),(2,21,6),(3,22,7),(4,23,8),(5,24,9),(6,25,10),(7,26,11),
(4,27,12),(3,28,13),(2,29,14),(1,30,15);
Go

create table [Students]
(
	[Id] int not null identity(1, 1) primary key,
	[Name_Surname] nvarchar(max) not null check ([Name_Surname] <> N''),
	[GroupId] int not null
);
go
alter table [Students]
add foreign key ([GroupId]) references [Groups]([Id]);
go

insert into [Students] ([Name_Surname], [GroupId]) 
VALUES
('Евдокимов Виктор Алексеевич',1),('Зеленский Александр Владимирович',1),('Долгих Кирилл Андреевич',1),('Новокрещенов Сергей Владимирович',1),
('Иванов Андрей Андреевич',1),('Бахчеев Сергей Александрович',1),('Кинжинов Зиннюр Енокович',1),('Голубев Андрей Александрович',1),
('Балахонова Любовь Владимировна ',2),('Воробьева Ольга Муршидовна ',2),('Полозова Елена Александровна ',2),('Сафронов Константин Александрович',2),
('Будакова Асмархон Акматовна',3),('Черевишняя Анна Анатольевна ',3),('Каленюк Юлия Владимировна ',3),('Сатукова Эльмира Ибрагимовна ',3),
('Губина Елена Андреевна ',3),('Лукьянова Ольга Анатольевна ',4),('Заика Марина Александровна ',4),('Бурмистрова Алина Анатольевна ',4),
('Тоболева Ольга Михайловна',5),('Курилова Алѐна Владимировна ',5),('Васильева Светлана Алексанровна ',6),('Коровина Анастасия Раисовна ',6),
('Савина Ольга Николаевна ',6),('Кардашова Алена Влаимировна ',6),('Сапаргалиева Эльвира Андреевна ',6),
('Бейфус Виктория Владиславовна ',6),('Ташпакова Карина Саматовна ',6),('Аргунова Елизавета Артемовна ',6),
('Хихловская Виктория Андреевна ',6),('Долгова Ангелина Альбертовна ',6),('Мищенко Кристина Антоновна ',7),
('Абдулинова Джамиля Булатовна ',7),('Яковлев Юрий Петрович ',7),('Бумарскова Дарья Олеговна ',7),
('Шепелева Марина Алексеевна ',7),('Болотова Виктория Игоревна ',7),('Кашеварова Ирина Олеговна ',7),
('Козляева Дарья Сергеевна ',7),('Швец Ирина Александровна ',7),('Хованов Алексей Валерьевич ',7),
('Палий Александр Сергеевич ',7),('Вахтель Анастасия Ивановна ',7),('Фабричная Тамара Валерьевна ',8),
('Головченко Виктория Олеговна ',8),('Моисеева Снежана Олеговна ',8),('Мииева Мадина Салавдиевна ',8),
('Ибрашева Зульфия Сагнгалиевна ',9),('Телюк Марина Викторовна ',9),('Уразгалиева Алия Утарбаевна ',9),
('Гулямов Сергей Юрьевич ',9),('Астахов Дмитрий Алексеевич',10),('Аникиенко Даниил Михайлович',10),
('Агеев Александр Александрович',10),('Хайрушева Айнуль Кабдукадировна',10),('Воробьев Михаил Сергеевич',10),
('Булгаков Константин Денисович',10),('Болтышов Игорь Андреевич ',11),('Бадиков Константин Владимирович',11),
('Клячева Алина Александровна',11),('Карамян Давид Енокович',11),('Захаров Денис Владимирович',11),
('Епифанова Анна Михайловна',11),('Кузьмин Александр Сергеевич',12),('Кривошеева Валерия Викторовна',12),
('Кочнева Дарья Владимировна',12),('Косованов Тимур Ахмедович ',13),('Пивень Александр Дмитриевич',13),
('Некрасов Владислав Павлович',13),('Мороз Никита Александрович',13),('Мартьянов Кирилл Андреевич',13),
('Рудич Сергей Алексеевич',14),('Романов Денис Алексеевич',14),('Понамарев Артем Михайлович',14),('Пирогов Артем Владимирович',14),('Арнгольд Алиса Андреевна',14),('Алиева Ирина Владимировна ',15),
('Шипов Иван Александрович',15),('Сильных Антон Игоревич',15),('Джумалиев Максим Олегович',16),
('Бохонова Алена Павловна',16),('Беспалова Александра Евгеньевна',16),('Бабенко Дмитрий Сергеевич',16),
('Козынченко Андрей Александрович',17),('Ибрянов Игорь Андреевич',17),('Золотухина Кристина Николаевна',18),
('Зайцев Дмитрий Александрович',18),('Малышева Анна Алексеевна',19),('Малинин Александр Владимирович',19),
('Ксѐнда Светлана Сергеевна',19),('Кривоберец Кирилл Евгеньевич',19),('Темралиев Мансур Аскарович',20),
('Петяев Даниил Эдуардович',20),('Паненко Алла Николаевна',20),('Новиков Егор Владимирович',20),
('Худашкин Максим Сергеевич',21),('Фролова Вероника Владимировна',21),('Федоров Владимир Михайлович',21),
('Токарева Валерия Петровна',21),('Акчурин Дамир Раисович',21),('Юрьев Виктор Александрович',21),
('Севостьянова Елена Дмитриевна',21),('Щербаков Андрей Викторович',22),('Ишанкулов Никита Александрович',22),
('Валуйский Вячеслав Витальевич',22),('Бахтаров Иван Владимирович',22),('Баландин Сергей Иванович',22),
('Которов Дмитрий Станиславович',23),('Кореев Артѐм Александрович',23),('Кокин Юрий Александрович',23),('Ким Тимур Анатольевич',23),
('Маликов Никита Семѐнович',23),('Лайдин Александр Константинович',24),('Кумаров Руслан Ринатович',24),('Коцарь Сергей Владимирович',24),
('Печѐнкин Артѐм Олегович',24),('Николаев Сергей Петрович',24),('Михайлов Кирилл Витальевич',24),('Мецкер Даниил Сергеевич',24),
('Таранов Юрий Сергеевич',25),('Сердгалиев Амир Дмитриевич',25),('Сергеев Максим Игоревич',25),('Сергеев Дмитрий Игоревич',26),
('Ятимов Фархот Киѐмуддинович',26),('Шакимов Самат Серикович',26),('Фисенко Данила Витальевич',26),('Торгашин Иван Сергеевич',26),
('Андреева Алина Юрьевна',27),('Андреева Алина Юрьевна',27),('Андреева Алина Юрьевна',27),('Ананьева Анастасия Алексеевна',27),
('Андреева Алина Юрьевна',28),('Андреева Алина Юрьевна',28),('Андреева Алина Юрьевна',28),('Андреева Алина Юрьевна',28),
('Склярова Анастасия Юрьевна',29),('Бугрова Елизавета Александровна',29),('Бондаренко Софья Петровна',29),('Белякова Ксения Сергеевна',29),
('Старовойтова Дарья Сергеевна',30),('Тугушев Дамир Русланович',30),('Чупрына Алина Владимировна',30),('Чугавина Татьяна Сергеевна',29);
go 

